Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1b"[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_subnet.private[2][0m will be created[0m[0m[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "private" {[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "eu-west-1c"[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.0.3.0/24"[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1c"[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1c"[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_subnet.public[0][0m will be created[0m[0m[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "public" {[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "eu-west-1a"[0m
[90m07:52:36.459 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.0.101.0/24"[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-public-eu-west-1a"[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-public-eu-west-1a"[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.460 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_subnet.public[1][0m will be created[0m[0m[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "public" {[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "eu-west-1b"[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.0.102.0/24"[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-public-eu-west-1b"[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.461 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-public-eu-west-1b"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_subnet.public[2][0m will be created[0m[0m[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "public" {[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "eu-west-1c"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.0.103.0/24"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-public-eu-west-1c"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-public-eu-west-1c"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.462 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_vpc.this[0][0m will be created[0m[0m[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_vpc" "this" {[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcidr_block[0m[0m                           = "10.0.0.0/16"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdefault_network_acl_id[0m[0m               = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m               = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdefault_security_group_id[0m[0m            = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdhcp_options_id[0m[0m                      = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_dns_hostnames[0m[0m                 = true[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_dns_support[0m[0m                   = true[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_network_address_usage_metrics[0m[0m = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_tenancy[0m[0m                     = "default"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_association_id[0m[0m                  = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                      = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_cidr_block_network_border_group[0m[0m = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mmain_route_table_id[0m[0m                  = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m                             = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_vpn_gateway.this[0][0m will be created[0m[0m[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_vpn_gateway" "this" {[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mamazon_side_asn[0m[0m = "64512"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m             = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m            = {[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m        = {[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.463 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc"[0m
[90m07:52:36.464 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.464 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.464 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m          = (known after apply)[0m
[90m07:52:36.464 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.464 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[1mPlan:[0m 32 to add, 0 to change, 0 to destroy.[0m
[90m07:52:36.464 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[0m
[90m07:52:36.479 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[0m
[90m07:52:36.479 [0m[37mSTDOUT [0m[36mterraform: [0m[1mChanges to Outputs:[0m[0m[0m
[90m07:52:36.479 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mazs[0m[0m                                         = [[0m
[90m07:52:36.479 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"eu-west-1a",[0m
[90m07:52:36.479 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"eu-west-1b",[0m
[90m07:52:36.479 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"eu-west-1c",[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mcgw_arns[0m[0m                                    = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mcgw_ids[0m[0m                                     = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdatabase_nat_gateway_route_ids[0m[0m              = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdatabase_route_table_association_ids[0m[0m        = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdatabase_route_table_ids[0m[0m                    = (known after apply)[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdatabase_subnet_arns[0m[0m                        = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdatabase_subnets[0m[0m                            = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdatabase_subnets_cidr_blocks[0m[0m                = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdatabase_subnets_ipv6_cidr_blocks[0m[0m           = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdefault_network_acl_id[0m[0m                      = (known after apply)[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m                      = (known after apply)[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mdefault_security_group_id[0m[0m                   = (known after apply)[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0melasticache_route_table_association_ids[0m[0m     = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0melasticache_route_table_ids[0m[0m                 = (known after apply)[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0melasticache_subnet_arns[0m[0m                     = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0melasticache_subnets[0m[0m                         = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0melasticache_subnets_cidr_blocks[0m[0m             = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0melasticache_subnets_ipv6_cidr_blocks[0m[0m        = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0migw_arn[0m[0m                                     = (known after apply)[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0migw_id[0m[0m                                      = (known after apply)[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mintra_route_table_association_ids[0m[0m           = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mintra_route_table_ids[0m[0m                       = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mintra_subnet_arns[0m[0m                           = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mintra_subnets[0m[0m                               = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mintra_subnets_cidr_blocks[0m[0m                   = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mintra_subnets_ipv6_cidr_blocks[0m[0m              = [][0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mname[0m[0m                                        = "my-vpc"[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mnat_ids[0m[0m                                     = [[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mnat_public_ips[0m[0m                              = [[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.480 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mnatgw_ids[0m[0m                                   = [[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0moutpost_subnet_arns[0m[0m                         = [][0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0moutpost_subnets[0m[0m                             = [][0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0moutpost_subnets_cidr_blocks[0m[0m                 = [][0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0moutpost_subnets_ipv6_cidr_blocks[0m[0m            = [][0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mprivate_ipv6_egress_route_ids[0m[0m               = [][0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mprivate_nat_gateway_route_ids[0m[0m               = [[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.481 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mprivate_route_table_association_ids[0m[0m         = [[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mprivate_route_table_ids[0m[0m                     = [[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mprivate_subnet_arns[0m[0m                         = [[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mprivate_subnets[0m[0m                             = [[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.482 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mprivate_subnets_cidr_blocks[0m[0m                 = [[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"10.0.1.0/24",[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"10.0.2.0/24",[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"10.0.3.0/24",[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mprivate_subnets_ipv6_cidr_blocks[0m[0m            = [][0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mpublic_internet_gateway_route_id[0m[0m            = (known after apply)[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mpublic_route_table_association_ids[0m[0m          = [[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mpublic_route_table_ids[0m[0m                      = [[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mpublic_subnet_arns[0m[0m                          = [[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.483 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mpublic_subnets[0m[0m                              = [[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mpublic_subnets_cidr_blocks[0m[0m                  = [[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"10.0.101.0/24",[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"10.0.102.0/24",[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m"10.0.103.0/24",[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mpublic_subnets_ipv6_cidr_blocks[0m[0m             = [][0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mredshift_public_route_table_association_ids[0m[0m = [][0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mredshift_route_table_association_ids[0m[0m        = [][0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mredshift_route_table_ids[0m[0m                    = [[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m(known after apply),[0m
[90m07:52:36.484 [0m[37mSTDOUT [0m[36mterraform: [0m    ]
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mredshift_subnet_arns[0m[0m                        = [][0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mredshift_subnets[0m[0m                            = [][0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mredshift_subnets_cidr_blocks[0m[0m                = [][0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mredshift_subnets_ipv6_cidr_blocks[0m[0m           = [][0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mthis_customer_gateway[0m[0m                       = {}[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvgw_arn[0m[0m                                     = (known after apply)[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvgw_id[0m[0m                                      = (known after apply)[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_arn[0m[0m                                     = (known after apply)[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_cidr_block[0m[0m                              = "10.0.0.0/16"[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_enable_dns_hostnames[0m[0m                    = true[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_enable_dns_support[0m[0m                      = true[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_flow_log_destination_type[0m[0m               = "cloud-watch-logs"[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_id[0m[0m                                      = (known after apply)[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_instance_tenancy[0m[0m                        = "default"[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_ipv6_association_id[0m[0m                     = (known after apply)[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_ipv6_cidr_block[0m[0m                         = (known after apply)[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_main_route_table_id[0m[0m                     = (known after apply)[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_owner_id[0m[0m                                = (known after apply)[0m
[90m07:52:36.485 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m [0m[1m[0mvpc_secondary_cidr_blocks[0m[0m                   = [][0m
[90m07:52:36.501 [0m[37mSTDOUT [0m[36mterraform: [0m[33m╷[0m[0m[0m
[90m07:52:36.501 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m[0m
[90m07:52:36.501 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0m[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0m[0m  with aws_eip.nat,[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0m  on main.tf line 1044, in resource "aws_eip" "nat":[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0m1044:   vpc = [4mtrue[0m[0m[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0m[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0muse domain attribute instead[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0m[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[33m│[0m [0m(and 3 more similar warnings elsewhere)[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[33m╵[0m[0m[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m[90m[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0m─────────────────────────────────────────────────────────────────────────────[0m[0m
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0mNote: You didn't use the -out option to save this plan, so Terraform can't
[90m07:52:36.509 [0m[37mSTDOUT [0m[36mterraform: [0mguarantee to take exactly these actions if you run "terraform apply" now.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/aws/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=dinhdobathi1992%252Fterragrunt-multi-cloud%252Flive%252Fdev%252Faws%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/aws/vpc`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
